A = {'馬林魚':'3勝4敗', '洋基':'5勝3敗', '天使':'4勝3敗', '道奇':'4勝4敗'}
B = {'馬林魚':'3勝4敗', '太空人':'5勝4敗', '洋基':'5勝3敗', '天使':'4勝3敗', '金鶯':'4勝5敗'} 

for i in iter(B):
    for l in iter(A):
        if(i != l and i not in A):
            A[i] = B[i]
            break
B.clear()
print(A)
print(B)

a = {'馬林魚':'3勝4敗', '洋基':'5勝3敗', '天使':'4勝3敗', '道奇':'4勝4敗'}
b = {'馬林魚':'3勝4敗', '太空人':'5勝4敗', '洋基':'5勝3敗', '天使':'4勝3敗', '金鶯':'4勝5敗'}

for i in iter(b):
    a.setdefault(i, b[i])
b.clear()     
print(a)
print(b)